# ── Taps ──
tap "nikitabobko/tap"      # for aerospace
tap "FelixKratz/formulae"  # for sketchybar

# ── Formulae ──
brew "asitop"
brew "coreutils"
brew "fastfetch"
brew "git"
brew "jq"
brew "lazygit"
brew "mas"
brew "ncdu"
brew "neovim"
brew "syncthing"
brew "uv"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ── Casks ──
cask "adobe-acrobat-pro"
cask "aerospace"
cask "arc"
cask "betterdisplay"
cask "calibre"
cask "chatgpt"
cask "discord"
cask "ghostty"
cask "github"
cask "google-chrome"
# cask "itsycal"
# cask "jan"
# cask "jordanbaird-ice"
cask "karabiner-elements"
cask "logi-options+"
cask "mactex"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "moonlight"
cask "obsidian"
cask "onedrive"
cask "orbstack"
cask "pdfsam-basic"
cask "sketchybar"
cask "stats"
cask "sublime-text"
# cask "texstudio"
cask "visual-studio-code"
cask "vlc"
cask "zen"
cask "zoom"
cask "zotero"

# ── Fonts and Symbols ──
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "sf-symbols"
cask "font-sketchybar-app-font"

# ── Mac App Store Apps ──
#mas "iWallpaper - Live Wallpaper", id: 1552826194
mas "pap.er 优雅壁纸", id:1639052102
