# ── Taps ──
tap "homebrew/core"
tap "homebrew/cask"

# ── Formulae ──
brew "asitop"
brew "fastfetch"
brew "git"
brew "lazygit"
brew "ncdu"
brew "neovim"
brew "syncthing"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ── Casks ──
cask "adobe-acrobat-pro"
cask "aerospace"
cask "calibre"
cask "chatgpt"
cask "discord"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "karabiner-elements"
cask "logi-options+"
cask "mactex"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "moonlight"
cask "obsidian"
# cask "stats"
cask "texstudio"
cask "visual-studio-code"
cask "zoom"
cask "zotero"

