{
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "Sources": [
    {
      "Packages": [
        {"PackageIdentifier": "CrystalDewWorld.CrystalDiskInfo"},
        {"PackageIdentifier": "DigitalScholar.Zotero"},
        {"PackageIdentifier": "Docker.DockerDesktop"},
        {"PackageIdentifier": "Git.Git"},
        {"PackageIdentifier": "GitHub.GitHubDesktop"},
        {"PackageIdentifier": "Google.Chrome"},
        {"PackageIdentifier": "JesseDuffield.lazygit"},
        {"PackageIdentifier": "Logitech.OptionsPlus"},
        {"PackageIdentifier": "Microsoft.AppInstaller"},
        {"PackageIdentifier": "Microsoft.PowerToys"},
        {"PackageIdentifier": "Microsoft.VisualStudioCode"},
        {"PackageIdentifier": "Microsoft.WindowsTerminal"},
        {"PackageIdentifier": "Microsoft.WSL"},
        {"PackageIdentifier": "Neovim.Neovim"},
        {"PackageIdentifier": "NetEase.UURemote"},
        {"PackageIdentifier": "Obsidian.Obsidian"},
        {"PackageIdentifier": "REALiX.HWiNFO"},
        {"PackageIdentifier": "Syncthing.Syncthing"},
        {"PackageIdentifier": "TechPowerUp.GPU-Z"},
        {"PackageIdentifier": "Valve.Steam"},
        {"PackageIdentifier": "Zen-Team.Zen-Browser"}
      ],
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      }
    }
  ]
}
